tests/testing.org
#+TITLE: Running the tests
#+LANGUAGE: en
#+PROPERTY: header-args:bash :tangle no

Each =dagger call= bash block in the org files tangles to a command
file under =tests/commands/=.  The expected output tangles to
=tests/expected/=.  The test runner iterates over command files, runs
each one, and compares stdout to the expected output.

* Nix shell for testing
  :PROPERTIES:
  :ID:       c7e8f9a0-b1c2-3d4e-5f6a-7b8c9d0e1f2a
  :END:

  =test.sh= expects =pytest= and =pytest-asyncio= to be available on
  the host. This =shell.nix= provides them via =nix-shell= so the
  test suite can run without polluting the system Python:

  #+begin_src bash :tangle no
  nix-shell --run "./test.sh"
  #+end_src

  #+begin_src nix :tangle ../shell.nix
  { pkgs ? import <nixpkgs> {} }:

  pkgs.mkShell {
    packages = with pkgs; [
      python313
      python313Packages.pytest
      python313Packages.pytest-asyncio
    ];
  }
  #+end_src

* The test entry point
  :PROPERTIES:
  :ID:       d49833b6-c2c2-4041-aa38-b7afcb4c0ef9
  :END:

  The test script runs pytest directly. Tests call =dagger call=
  as subprocesses — no SDK connection needed.

  #+begin_src bash :tangle ../test.sh :shebang "#!/usr/bin/env bash"
  set -eu
  cd "$(dirname "$0")"
  exec pytest tests/test_sdk.py -v
  #+end_src

* Docker-in-Docker test entry point

  Dogfooding: run the test suite inside a DinD container using the
  project's own =dind-run-tests= function.

  #+begin_src bash :tangle ../test-dind.sh :shebang "#!/usr/bin/env bash"
  set -eu
  cd "$(dirname "$0")"
  exec dagger --progress plain call dind-run-tests stdout
  #+end_src

* Test fixtures
  :PROPERTIES:
  :ID:       b3c4d5e6-f7a8-9012-bcde-f01234567890
  :END:

  Each test is a pair: a command file in =tests/commands/= and an
  expected output file in =tests/expected/=.  The test runner runs
  each command with bash and compares stdout to the expected output.

  #+begin_src python :tangle test_sdk.py
  import os
  import subprocess
  from pathlib import Path

  import pytest

  ROOT = Path(__file__).resolve().parents[1]
  COMMANDS_DIR = Path(__file__).parent / "commands"
  EXPECTED_DIR = Path(__file__).parent / "expected"
  command_files = sorted(COMMANDS_DIR.glob("*")) if COMMANDS_DIR.exists() else []


  @pytest.mark.parametrize(
      "cmd_file", command_files, ids=[f.name for f in command_files],
  )
  def test_command(tmp_path, cmd_file):
      env = {**os.environ, "TMP": str(tmp_path), "ROOT": str(ROOT)}
      env["PATH"] = str(ROOT / "tests") + ":" + env.get("PATH", "")
      result = subprocess.run(
          ["bash", str(cmd_file)],
          capture_output=True,
          text=True,
          cwd=str(ROOT),
          env=env,
      )
      assert result.returncode == 0, (
          f"command {cmd_file.name} failed (exit {result.returncode}):\n{result.stderr}"
      )
      expected_file = EXPECTED_DIR / cmd_file.name
      expected = expected_file.read_text().rstrip("\n") if expected_file.exists() else ""
      assert result.stdout.rstrip("\n") == expected, (
          f"{cmd_file.name}: got {result.stdout.rstrip(chr(10))!r},"
          f" expected {expected!r}"
      )
  #+end_src

* Dagger wrapper for batch execution
  :PROPERTIES:
  :ID:       a1b2c3d4-e5f6-7890-abcd-ef1234567890
  :END:

  Dagger's TUI writes terminal escape sequences (=\e]11;?=) directly
  to =/dev/tty=, which breaks Emacs comint sessions. This wrapper
  finds the real =dagger= binary, sets =DARK=1= to skip the terminal
  background query, and redirects stderr to suppress progress output.

  #+begin_src bash :tangle dagger :shebang "#!/usr/bin/env bash"
    export DAGGER_NO_NAG=1
    export DARK=1
    DAGGER_PATH="$(which -a dagger|grep -v /tests/|head -1)"
    args=("$@")
    exec "$DAGGER_PATH" --silent "${args[@]}" 2>/dev/null
  #+end_src
